app/controllers/galleries_controller.rb

INSERT INTO "galleries" ("species_name", "description", "version", "link", "sortnumber", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @gallery = Gallery.new(gallery_params)

    respond_to do |format|
      if @gallery.save

SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_gallery
      @gallery = Gallery.find(params[:id])